_posts/2022-02-03-boj-1446.html
---
title: BOJ 1446 지름길
tags: 최단거리 DP
toc: true
toc_sticky: true
---

<div id="outline-container-org7d81300" class="outline-2">
<h2 id="org7d81300">BOJ 11657 지름길</h2>
<div class="outline-text-2" id="text-org7d81300">
<ul class="org-ul">
<li>다익스트라를 변형하는 문제</li>
<li>DP로 분류해도 좋을 문제</li>
</ul>
</div>
</div>

<div id="outline-container-orge8d4d97" class="outline-2">
<h2 id="orge8d4d97">접근하기</h2>
<div class="outline-text-2" id="text-orge8d4d97">
<pre class="example">
dp[i] : 1~i까지의 제일 짦은 거리 (지름길)

1~D까지 loop
{
  dp[i] = min(dp[i], dp[i-1]+1, dp[지름길k.start] + 지름길k.end)
}
</pre>
</div>
</div>

<div id="outline-container-orge4da01c" class="outline-2">
<h2 id="orge4da01c">코드 - vector</h2>
<div class="outline-text-2" id="text-orge4da01c">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">FASTIO</span> <span style="color: #8ae234;">ios_base</span>::sync_with_stdio(<span style="color: #8ae234;">false</span>); cin.tie(<span style="color: #8ae234;">NULL</span>);
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">INF</span> 987654321

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">D</span>;
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Node</span> {
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">s</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">e</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">c</span>;
} <span style="color: #8ae234; font-weight: bold;">Node</span>;

<span style="color: #8ae234; font-weight: bold;">vector</span>&lt; <span style="color: #8ae234; font-weight: bold;">Node</span> &gt; <span style="color: #ff6347;">vec</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">dp</span>[10010];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    <span style="color: #8ae234; font-weight: bold;">FASTIO</span>
    <span style="color: #ff6347;">cin</span> &gt;&gt; N &gt;&gt; D;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;10010;i++) {
        dp[i] = INF;
    }

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">p1</span>, <span style="color: #ff6347;">p2</span>, <span style="color: #ff6347;">cost</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        cin &gt;&gt; p1 &gt;&gt; p2 &gt;&gt; cost;
        <span style="color: #729fcf; font-weight: bold;">if</span> (p2 &gt; D) <span style="color: #729fcf; font-weight: bold;">continue</span>;
        <span style="color: #729fcf; font-weight: bold;">if</span> (p2 -p1 &lt; cost) <span style="color: #729fcf; font-weight: bold;">continue</span>;
        vec.push_back({p1, p2, cost});
    }

    dp[0] = 0;

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=D;i++) {
        dp[i] = min(dp[i], dp[i-1] + 1);
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span> <span style="color: #ff6347;">o</span>:vec) {
            <span style="color: #729fcf; font-weight: bold;">if</span> (o.e == i &amp;&amp; dp[i] &gt; dp[o.s] + o.c)
                dp[i] = dp[o.s] + o.c;
        }
    }

    cout &lt;&lt; dp[D] &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">'\n'</span>;
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3633c91" class="outline-2">
<h2 id="org3633c91">코드 - vector arr</h2>
<div class="outline-text-2" id="text-org3633c91">
<div class="org-src-container">
<pre class="src src-cpp">i#<span style="color: #8ae234; font-weight: bold;">include</span> &lt;bits/stdc++.h&gt;
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">FASTIO</span> <span style="color: #8ae234;">ios_base</span>::sync_with_stdio(<span style="color: #8ae234;">false</span>); cin.tie(<span style="color: #8ae234;">NULL</span>);
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">INF</span> 987654321

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">D</span>;
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Node</span> {
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">s</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">c</span>;
} <span style="color: #8ae234; font-weight: bold;">Node</span>;

<span style="color: #8ae234; font-weight: bold;">vector</span>&lt; <span style="color: #8ae234; font-weight: bold;">Node</span> &gt; <span style="color: #ff6347;">vec</span>[10010];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">dp</span>[10010];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    <span style="color: #8ae234; font-weight: bold;">FASTIO</span>
    <span style="color: #ff6347;">cin</span> &gt;&gt; N &gt;&gt; D;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;10010;i++) {
        dp[i] = INF;
    }

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">p1</span>, <span style="color: #ff6347;">p2</span>, <span style="color: #ff6347;">cost</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        cin &gt;&gt; p1 &gt;&gt; p2 &gt;&gt; cost;
        <span style="color: #729fcf; font-weight: bold;">if</span> (p2 &gt; D) <span style="color: #729fcf; font-weight: bold;">continue</span>;
        <span style="color: #729fcf; font-weight: bold;">if</span> (p2 -p1 &lt; cost) <span style="color: #729fcf; font-weight: bold;">continue</span>;
        vec[p2].push_back({p1, cost});
    }

    dp[0] = 0;

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=D;i++) {
        dp[i] = min(dp[i], dp[i-1] + 1);
        <span style="color: #729fcf; font-weight: bold;">if</span> (vec[i].size() != 0) {
            <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span> <span style="color: #ff6347;">o</span>:vec[i]) {
                dp[i] = min(dp[i], dp[o.s] + o.c);
            }
        }
    }

    cout &lt;&lt; dp[D] &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">'\n'</span>;
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org81a3e56" class="outline-2">
<h2 id="org81a3e56">문제 링크</h2>
<div class="outline-text-2" id="text-org81a3e56">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/1446">https://www.acmicpc.net/problem/1446</a></li>
</ul>
</div>
</div>
